ext_b24/DataProcessors/алсавб24_ВыгрузкаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсавб24_ВыгрузкаКонтрагентов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_b24/InformationRegisters/алсавб24_СопоставлениеОбъектовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсавб24_СопоставлениеОбъектовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TITLE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ENTITY_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ENTITY_TYPE_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_b24/DataProcessors/алсавб24_ВыгрузкаКонтрагентов/Ext/ManagerModule.bsl
// Модуль выгрузки контрагентов из 1С в Битрикс24
// Обеспечивает синхронизацию данных справочника Контрагенты с компаниями в CRM Битрикс24

///
// Проверить наличие сопоставления контрагента в регистре
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
// Возвращаемое значение:
//  Число - ID компании в Б24 или 0 если не найдено
//
Функция ПроверитьСопоставлениеКонтрагента(Контрагент) Экспорт

	// Сначала ищем по ORIGIN_ID (уникальный идентификатор 1С)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алсавб24_СопоставлениеОбъектовБ24.ENTITY_ID КАК ID
		|ИЗ
		|	РегистрСведений.алсавб24_СопоставлениеОбъектовБ24 КАК алсавб24_СопоставлениеОбъектовБ24
		|ГДЕ
		|	алсавб24_СопоставлениеОбъектовБ24.Объект1С = &Контрагент
		|	И алсавб24_СопоставлениеОбъектовБ24.ENTITY_TYPE_ID = &ENTITY_TYPE_ID";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ID;

КонецФункции

///
// Найти компанию в Б24 по ORIGIN_ID
// Параметры:
//  ORIGIN_ID - Строка - уникальный идентификатор контрагента из 1С
// Возвращаемое значение:
//  Число - ID компании в Б24 или 0 если не найдено
//
Функция НайтиКомпаниюПоОriginID(ORIGIN_ID) Экспорт

	Фильтр = Новый Структура;
	Фильтр.Вставить("ORIGIN_ID", ORIGIN_ID);

	APIРезультат = Обработки.алсавб24_api_CRM_Компании.crm_company_list(Фильтр);

	Если APIРезультат.Свойство("result") И APIРезультат.result.Количество() > 0 Тогда
		Возврат APIРезультат.result[0].ID;
	КонецЕсли;

	Возврат 0;

КонецФункции

///
// Подготовить поля контрагента для выгрузки в Б24
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
// Возвращаемое значение:
//  Структура - поля для API Б24
//
Функция ПодготовитьПоляКонтрагента(Контрагент) Экспорт

	Поля = Новый Структура;

	// Основные поля
	Поля.Вставить("TITLE", Контрагент.Наименование);

	// Поля для идентификации источника
	Поля.Вставить("ORIGIN_ID", Строка(Контрагент.УникальныйИдентификатор()));
	Поля.Вставить("ORIGINATOR_ID", "1С8 УТ11");
	Поля.Вставить("ORIGIN_VERSION", ПолучитьНавигационнуюСсылку(Контрагент));

	// Комментарий
	Если ЗначениеЗаполнено(Контрагент.ДополнительнаяИнформация) Тогда
		Поля.Вставить("COMMENTS", Контрагент.ДополнительнаяИнформация);
	КонецЕсли;

	// Контактная информация - для мультиполей используем массив структур
	Телефоны = Новый Массив;
	Emails = Новый Массив;
	Сайты = Новый Массив;
	СтрокаАдресов = "";

		КонтактнаяИнформация = Контрагент.КонтактнаяИнформация;
		Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				// Разделяем номера телефонов, если они записаны через запятую
				НомераТелефонов = СтрРазделить(СтрокаКИ.Представление, ",", Ложь);
				Для Каждого НомерТелефона Из НомераТелефонов Цикл
					Телефон = Новый Структура;
					Телефон.Вставить("VALUE", СокрЛП(НомерТелефона));
					Телефон.Вставить("VALUE_TYPE", "WORK");
					Телефоны.Добавить(Телефон);
				КонецЦикла;
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			// Разделяем адреса email, если они записаны через запятую
			АдресаEmail = СтрРазделить(СтрокаКИ.Представление, ",", Ложь);
			Для Каждого АдресEmail Из АдресаEmail Цикл
				Email = Новый Структура;
				Email.Вставить("VALUE", СокрЛП(АдресEmail));
				Email.Вставить("VALUE_TYPE", "WORK");
				Emails.Добавить(Email);
			КонецЦикла;
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			Сайт = Новый Структура;
			Сайт.Вставить("VALUE", СтрокаКИ.Представление);
			Сайт.Вставить("VALUE_TYPE", "WORK");
			Сайты.Добавить(Сайт);
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
				Если Не ПустаяСтрока(СтрокаАдресов) Тогда
					СтрокаАдресов = СтрокаАдресов + "; ";
				КонецЕсли;
				СтрокаАдресов = СтрокаАдресов + СтрокаКИ.Представление;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если Телефоны.Количество() > 0 Тогда
		Поля.Вставить("PHONE", Телефоны);
	КонецЕсли;

	Если Emails.Количество() > 0 Тогда
		Поля.Вставить("EMAIL", Emails);
	КонецЕсли;

	Если Сайты.Количество() > 0 Тогда
		Поля.Вставить("WEB", Сайты);
	КонецЕсли;

	Если Не ПустаяСтрока(СтрокаАдресов) Тогда
		Поля.Вставить("ADDRESS", СтрокаАдресов);
	КонецЕсли;

	// Юридические реквизиты
	Если ЗначениеЗаполнено(Контрагент.ИНН) Тогда
		Поля.Вставить("RQ_INN", Контрагент.ИНН);
	КонецЕсли;

	Если ЗначениеЗаполнено(Контрагент.КПП) Тогда
		Поля.Вставить("RQ_KPP", Контрагент.КПП);
	КонецЕсли;

	Возврат Поля;

КонецФункции

///
// Зарегистрировать новое сопоставление контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDБ24 - Число - ID компании в Б24
//
Процедура ЗарегистрироватьСопоставление(Контрагент, IDБ24) Экспорт

	НаборЗаписей = РегистрыСведений.алсавб24_СопоставлениеОбъектовБ24.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ENTITY_ID.Установить(IDБ24);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ENTITY_ID = IDБ24;
	НоваяЗапись.ENTITY_TYPE_ID = Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания();
	НоваяЗапись.Объект1С = Контрагент;
	НоваяЗапись.TITLE = Контрагент.Наименование;

	НаборЗаписей.Записать();

КонецПроцедуры

///
// Основная функция выгрузки контрагента в Б24
// Параметры:
//  ссылкаНаКонтрагента - СправочникСсылка.Контрагенты - ссылка на контрагента для выгрузки
// Возвращаемое значение:
//  Структура - результат операции с ID и статусом
//
Функция ВыгрузитьВБ24(ссылкаНаКонтрагента) ЭКСПОРТ

	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ID", 0);
	Результат.Вставить("Сообщение", "");

	Попытка
		// Шаг 1: Проверяем наличие сопоставления в регистре
		IDБ24ИзРегистра = ПроверитьСопоставлениеКонтрагента(ссылкаНаКонтрагента);

		// Шаг 2: Ищем компанию в Б24 по ORIGIN_ID только если не нашли в регистре
		IDБ24ИзAPI = 0;
		Если IDБ24ИзРегистра = 0 Тогда
			ORIGIN_ID = Строка(ссылкаНаКонтрагента.УникальныйИдентификатор());
			IDБ24ИзAPI = НайтиКомпаниюПоОriginID(ORIGIN_ID);
		КонецЕсли;

		// Шаг 3: Подготавливаем поля контрагента
		Поля = ПодготовитьПоляКонтрагента(ссылкаНаКонтрагента);

		// Шаг 4: Определяем ID компании для обновления или создания
		ИтоговыйIDБ24 = 0;

		Если IDБ24ИзРегистра > 0 Тогда
			ИтоговыйIDБ24 = IDБ24ИзРегистра;
		ИначеЕсли IDБ24ИзAPI > 0 Тогда
			ИтоговыйIDБ24 = IDБ24ИзAPI;
			// Регистрируем найденное сопоставление
			ЗарегистрироватьСопоставление(ссылкаНаКонтрагента, IDБ24ИзAPI);
		КонецЕсли;

		// Шаг 5: Выполняем действие в зависимости от результата проверки
		Если ИтоговыйIDБ24 > 0 Тогда
			// Обновляем существующую компанию
			APIРезультат = Обработки.алсавб24_api_CRM_Компании.crm_company_update(ИтоговыйIDБ24, Поля);

			Если APIРезультат.Свойство("result") Тогда
				// Обновляем универсальные реквизиты
				ОбновитьУниверсальныеРеквизиты(ссылкаНаКонтрагента, ИтоговыйIDБ24);

				Результат.Успех = Истина;
				Результат.ID = ИтоговыйIDБ24;
				Результат.Сообщение = "Компания успешно обновлена в Б24";
			Иначе
				Результат.Сообщение = "Ошибка при обновлении компании: " + APIРезультат.Описание;
			КонецЕсли;
		Иначе
			// Создаем новую компанию
			APIРезультат = Обработки.алсавб24_api_CRM_Компании.crm_company_add(Поля);

			Если APIРезультат.Свойство("result") Тогда
				НовыйID = APIРезультат.result;

				// Регистрируем новое сопоставление
				ЗарегистрироватьСопоставление(ссылкаНаКонтрагента, НовыйID);

				// Создаем универсальные реквизиты
				СоздатьУниверсальныеРеквизиты(ссылкаНаКонтрагента, НовыйID);

				Результат.Успех = Истина;
				Результат.ID = НовыйID;
				Результат.Сообщение = "Компания успешно создана в Б24";
			Иначе
				Результат.Сообщение = "Ошибка при создании компании: " + APIРезультат.Описание;
			КонецЕсли;
		КонецЕсли;

	Исключение
		Результат.Сообщение = "Критическая ошибка: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

///
// Создать универсальные реквизиты для контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDКомпанииБ24 - Число - ID компании в Б24
//
Процедура СоздатьУниверсальныеРеквизиты(Контрагент, IDКомпанииБ24) Экспорт

	// Подготавливаем реквизиты в зависимости от типа лица
	Если Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		ПоляРеквизитов = Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.ПодготовитьРеквизитыЮрЛица(Контрагент, IDКомпанииБ24);
	Иначе
		ПоляРеквизитов = Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.ПодготовитьРеквизитыФизЛица(Контрагент, IDКомпанииБ24);
	КонецЕсли;

	// Создаем универсальные реквизиты
	APIРезультат = Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.crm_requisite_add(ПоляРеквизитов);

	Если APIРезультат.Свойство("result") Тогда
		IDРеквизитов = APIРезультат.result;

		// Регистрируем сопоставление для универсальных реквизитов
		Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.ЗарегистрироватьСопоставлениеУниверсальныхРеквизитов(
			IDРеквизитов, Контрагент, "Универсальные реквизиты: " + Контрагент.Наименование);
	КонецЕсли;

КонецПроцедуры

///
// Обновить универсальные реквизиты для контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDКомпанииБ24 - Число - ID компании в Б24
//
Процедура ОбновитьУниверсальныеРеквизиты(Контрагент, IDКомпанииБ24) Экспорт

	// Ищем существующие реквизиты
	APIРезультат = Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.crm_requisite_list_by_company(
		IDКомпанииБ24, Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());

	Если APIРезультат.Свойство("result") И APIРезультат.result.Количество() > 0 Тогда
		// Обновляем первые найденные реквизиты
		СуществующиеРеквизиты = APIРезультат.result[0];
		IDРеквизитов = СуществующиеРеквизиты.Получить("ID");

		// Подготавливаем поля для обновления
		Если Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			ПоляРеквизитов = Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.ПодготовитьРеквизитыЮрЛица(Контрагент, IDКомпанииБ24);
		Иначе
			ПоляРеквизитов = Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.ПодготовитьРеквизитыФизЛица(Контрагент, IDКомпанииБ24);
		КонецЕсли;

		// Обновляем реквизиты
		Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.crm_requisite_update(IDРеквизитов, ПоляРеквизитов);

		// Обновляем сопоставление
		Обработки.алсавб24_api_CRM_УниверсальныеРеквизиты.ЗарегистрироватьСопоставлениеУниверсальныхРеквизитов(
			IDРеквизитов, Контрагент, "Универсальные реквизиты: " + Контрагент.Наименование);
	Иначе
		// Если реквизиты не найдены, создаем новые
		СоздатьУниверсальныеРеквизиты(Контрагент, IDКомпанииБ24);
	КонецЕсли;

КонецПроцедуры
